[
  {
    "title": "Luminos: The Price of 'Perfect Vision' - Part 1 The Foundation Day",
    "book": "Luminos: The Price of 'Perfect Vision'",
    "storyPart": 0,
    "genre": "Kethaneum",
    "words": ["principles", "changed", "taking", "credit", "solidarity", "shifting"],
    "storyExcerpt": "The Kethaneum's central chamber domed ceiling reflected the light of a thousand knowledge crystals. The air buzzed with the hum of anticipation as representatives from the founding realms gathered around the Concordance Table. Together, Luminos and I stood as equals, our complementary visions having created this unprecedented nexus of cross-realm understanding."
  },
  {
    "title": "Luminos: The Price of 'Perfect Vision' - Part 2 The First Fracture",
    "book": "Luminos: The Price of 'Perfect Vision'",
    "storyPart": 1,
    "genre": "Kethaneum",
    "words": ["vision", "clarity", "perfect", "control", "understanding", "balance"],
    "storyExcerpt": "The first signs were subtle. Luminos began speaking of 'perfect clarity' and 'ultimate understanding.' Where once we had collaborated, now he spoke only of his vision. The other founders noticed too, though few dared speak openly about the growing distance between Luminos and the principles we had established together."
  },
  {
    "title": "Luminos: The Price of 'Perfect Vision' - Part 3 The Breaking Point",
    "book": "Luminos: The Price of 'Perfect Vision'",
    "storyPart": 2,
    "genre": "Kethaneum",
    "words": ["betrayal", "power", "alone", "sacrifice", "truth", "darkness"],
    "storyExcerpt": "When Luminos proposed centralizing all knowledge under his 'perfect vision,' I knew I had to stand against him. The Kethaneum was meant to be a place of shared wisdom, not a monument to one being's ego. Our friendship shattered that day, and I became the keeper of uncomfortable truths he wished erased from the archives."
  },
  {
    "title": "Luminos: The Price of 'Perfect Vision' - Part 4 The Legacy",
    "book": "Luminos: The Price of 'Perfect Vision'",
    "storyPart": 3,
    "genre": "Kethaneum",
    "words": ["remember", "history", "warning", "future", "choice", "wisdom"],
    "storyExcerpt": "Now, as I record these events for future archivists, I wonder if anyone will read them. Luminos has rewritten so much, claimed so many achievements that were ours together. But the truth remains in these hidden archives, waiting for those brave enough to seek it. May you, dear reader, learn from our mistakes and choose a wiser path."
  }
]