{
  "title": "The Kethaneum",
  "paragraphs": [
    {
      "segments": [
        {
          "text": "If all the knowledge that was and had ever been was yours, what would you do with it? ",
          "italic": true
        }
      ]
    },
    {
      "segments": [
        {
          "text": "Is sharing in knowledge it's own reward? Or is being the keeper of it the prize? ",
          "italic": true
        }
      ]
    },
    {
      "segments": [
        {
          "text": "\n",
          "italic": true
        }
      ]
    },
    {
      "segments": [
        {
          "text": "\tThese thoughts cross your mind as your Book of Passage grows warm against your palms. You begin your transit. Excitement mingles with the strange tactile sensation of reality bending in ways your mind had not yet conceived possible. This was the culmination of an entire career's worth of hard work. Your life goal. The new sensations should comfort you, like a mantle of accomplishment. But the mantle sits awkward and off center like a garment that has ridden up uncomfortably but still technically fits. Unease creeps up your spine..."
        }
      ]
    },
    {
      "segments": [
        {
          "text": "\n"
        }
      ]
    },
    {
      "segments": [
        {
          "text": "\tThe unease builds as the warmth of transit turns sharp and erratic. Your Book of Passage pulses irregularly in hand. In a more stable version of reality, what would have been its pages rustle with what sounds like distress. The shifting gateway that should shepherd you smoothly between realms begins to stutter and spark. Reality fractures at its edges like glass under pressure."
        }
      ]
    },
    {
      "segments": [
        {
          "text": "\n"
        }
      ]
    },
    {
      "segments": [
        {
          "text": "Then it stops. ",
          "italic": true
        }
      ]
    },
    {
      "segments": [
        {
          "text": "\n",
          "italic": true
        }
      ]
    },
    {
      "segments": [
        {
          "text": "\tNot gracefully. Not with the gentle settling promised in every song, story, and telling of Kethaneum arrival. The portal simply... gives up. One moment you're suspended between worlds, the next you're deposited unceremoniously onto polished stone floors. It leaves you in a heap of tangle of limbs and wounded dignity."
        }
      ]
    },
    {
      "segments": [
        {
          "text": "\n"
        }
      ]
    },
    {
      "segments": [
        {
          "text": "\tAs you slowly extract yourself from the sprawl, dusting off robes that were meant to make a good first impression, you become acutely aware that you are not alone. From the quality of the silence surrounding you, whatever conversation had been held before your undignified entrance has died a VERY sudden death..."
        }
      ]
    },
    {
      "segments": [
        {
          "text": "\n"
        }
      ]
    },
    {
      "segments": [
        {
          "text": "\tVoices drift toward you as your mind remembers what vision is.. On one side, the tone is sharp with frustration. But it is wearily dismissive on the other."
        }
      ]
    },
    {
      "segments": [
        {
          "text": "\n"
        }
      ]
    },
    {
      "segments": [
        {
          "text": "\t\"—third malfunction this rotation,\" someone is hisses, genuine worry threading through their tone. \"The transit matrices aren't supposed to fluctuate like that. People could be hurt, or worse, lost between realms entirely.\""
        }
      ]
    },
    {
      "segments": [
        {
          "text": "\n"
        }
      ]
    },
    {
      "segments": [
        {
          "text": "\t\"Honestly...\" comes the reply. The response carries that particular brand of exhaustion reserved for explaining the obvious to the willfully stupid. \"As Luminos has stated... repeatedly, this is just growing pains from the new efficiency adjustments. There's no cause for concern. The Kethaneum is an ancient and complex structure. Modernization requires some temporary instability.\" The words sound practiced as does the dismissive tone that accompany them."
        }
      ]
    },
    {
      "segments": [
        {
          "text": "\n"
        }
      ]
    },
    {
      "segments": [
        {
          "text": "\t\"Temporary?!\" The first voice rises, incredulous in it's challenge. \"It NEVER failed before the modernization efforts.\" The statement cuts across the tension like giant claw marks. The speaker no longer trying to hide irritation. \"It's been MANY rotations of this—\""
        }
      ]
    },
    {
      "segments": [
        {
          "text": "\n"
        }
      ]
    },
    {
      "segments": [
        {
          "text": "\tA younger voice interrupts with the confidence of someone who's never been wrong about anything important. \"Exactly like I keep saying, some people are just too scared of change.\" In the conviction of someone who has yet to learn caution, they continue. \"They're stuck in some archaic past like Elara. Always wanting to keep the Kethaneum trapped in a lesser—\""
        }
      ]
    },
    {
      "segments": [
        {
          "text": "\n"
        }
      ]
    },
    {
      "segments": [
        {
          "text": "\tThe swift \"SHHH\" cuts across the room like a slap. Angry glares from both of the arguing parties focus on the junior who's slip carelessly careened into sensitive territory. The intruding statement dies on their tongue under the weight of collective rebuke. Both sides fall silent. The silence forms so abruptly you can practically hear it crystallize."
        }
      ]
    },
    {
      "segments": [
        {
          "text": "\n"
        }
      ]
    },
    {
      "segments": [
        {
          "text": "\tIn the heavy silence that follows, you attempt to rise with something resembling dignity. Your ceremonial robes - carefully chosen for this momentous first day - rustle against the polished stone."
        }
      ]
    },
    {
      "segments": [
        {
          "text": "\n"
        }
      ]
    },
    {
      "segments": [
        {
          "text": "Every head in the chamber turns toward you in perfect unison."
        }
      ]
    },
    {
      "segments": [
        {
          "text": "\n"
        }
      ]
    },
    {
      "segments": [
        {
          "text": "\tThe silence stretches. Eyes dart between you and each other, then back to you again. Someone clears their throat softly. Another person shifts their weight from foot to foot. The air feels thick, expectant."
        }
      ]
    },
    {
      "segments": [
        {
          "text": "\n"
        }
      ]
    },
    {
      "segments": [
        {
          "text": "\tA young staff member opens their mouth as if to speak, then closes it again when an older colleague shoots them a sharp look."
        }
      ]
    },
    {
      "segments": [
        {
          "text": "\n"
        }
      ]
    },
    {
      "segments": [
        {
          "text": "\tThe quiet becomes almost tangible, pressing against your ears like the weight of deep water."
        }
      ]
    },
    {
      "segments": [
        {
          "text": "\n"
        }
      ]
    },
    {
      "segments": [
        {
          "text": "\tThen, as soon as the hush settles, footsteps echo from a corridor beyond. The footfalls are measured, purposeful as they grow steadily closer. The sound breaks whatever spell holds everyone frozen in place."
        }
      ]
    },
    {
      "segments": [
        {
          "text": "\n"
        }
      ]
    },
    {
      "segments": [
        {
          "text": "\t\"Lumina. Tighten up,\" someone hisses urgently under their breath, barely audible."
        }
      ]
    },
    {
      "segments": [
        {
          "text": "\n"
        }
      ]
    },
    {
      "segments": [
        {
          "text": "\tLike a flock of startled birds, staff scatter in every direction. With practiced efficiency, they suddenly find themselves engrossed in their tasks. Documents shuffle. Equipment becomes fascinating. Every eye, regardless of how many the being possesses, find anything to look at except you, each other, or the person approaching."
        }
      ]
    },
    {
      "segments": [
        {
          "text": "\n"
        }
      ]
    },
    {
      "segments": [
        {
          "text": "\tThe footsteps come to a stop in front of you in the form of a dignified looking woman. Her species is unknown to you. (we can work out what lumina looks like later and add the description here)"
        }
      ]
    },
    {
      "segments": [
        {
          "text": "\n"
        }
      ]
    },
    {
      "segments": [
        {
          "text": "\t\"Welcome to the Kethaneum. You have achieved what many only dream of.\" Her voice is warm,  but authoritative. It carries easily across the reception chamber as if she is used to commanding a room upon arrival. You know from the robes she wears that she is senior faculty. This must have been the mentor you were expecting to greet you."
        }
      ]
    },
    {
      "segments": [
        {
          "text": "\n"
        }
      ]
    },
    {
      "segments": [
        {
          "text": "\tDespite, her focus on the task at hand, the frantic avoidance energy in the room is not lost on her. Her eyes sweep the room. She gives everyone the kind of comprehensive glance that misses nothing, no matter how brief it is. But then her gaze settles on you with genuine warmth."
        }
      ]
    },
    {
      "segments": [
        {
          "text": "\n"
        }
      ]
    },
    {
      "segments": [
        {
          "text": "\t\"I am Archivist Lumina. I apologize. I meant to be here to greet you, but an unexpected... situation detained me.\" As Lumina pauses glances are exchanged between the formerly arguing staff members. Beneath the surface, the same fault lines from earlier reflect in their eyes. Between allies knowing looks pass while glares silently attack each other across the line between the two groups."
        }
      ]
    },
    {
      "segments": [
        {
          "text": "\n"
        }
      ]
    },
    {
      "segments": [
        {
          "text": "Lumina continues. \"Come, let's examine your Book of Passage then head deeper into the library.\""
        }
      ]
    }
  ]
}